Import libraries

In [14]:
#import libraries
import pandas as pd
import numpy as np

Import csv files

In [15]:
#Reading train file:
train = pd.read_csv('https://raw.githubusercontent.com/TracyRenee61/Traffic-Forecasting/main/train_aWnotuB.csv')

In [16]:
train

                  DateTime  Junction  Vehicles           ID
0      2015-11-01 00:00:00         1        15  20151101001
1      2015-11-01 01:00:00         1        13  20151101011
2      2015-11-01 02:00:00         1        10  20151101021
3      2015-11-01 03:00:00         1         7  20151101031
4      2015-11-01 04:00:00         1         9  20151101041
...                    ...       ...       ...          ...
48115  2017-06-30 19:00:00         4        11  20170630194
48116  2017-06-30 20:00:00         4        30  20170630204
48117  2017-06-30 21:00:00         4        16  20170630214
48118  2017-06-30 22:00:00         4        22  20170630224
48119  2017-06-30 23:00:00         4        12  20170630234

[48120 rows x 4 columns]

In [17]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48120 entries, 0 to 48119
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   DateTime  48120 non-null  object
 1   Junction  48120 non-null  int64
 2   Vehicles  48120 non-null  int64
 3   ID        48120 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.5+ MB

Check for null values

Convert DateTime to year, month, day, and time

In [18]:
train['year'] = train['DateTime'].str[:4]

train['month'] = train['DateTime'].str[5:7]

train['day'] = train['DateTime'].str[8:10]

train['hour'] = train['DateTime'].str[11:13]

train['minute'] = train['DateTime'].str[14:16]

train['second'] = train['DateTime'].str[17:19]

train

                  DateTime  Junction  Vehicles  ...  hour minute second
0      2015-11-01 00:00:00         1        15  ...    00     00     00
1      2015-11-01 01:00:00         1        13  ...    01     00     00
2      2015-11-01 02:00:00         1        10  ...    02     00     00
3      2015-11-01 03:00:00         1         7  ...    03     00     00
4      2015-11-01 04:00:00         1         9  ...    04     00     00
...                    ...       ...       ...  ...   ...    ...    ...
48115  2017-06-30 19:00:00         4        11  ...    19     00     00
48116  2017-06-30 20:00:00         4        30  ...    20     00     00
48117  2017-06-30 21:00:00         4        16  ...    21     00     00
48118  2017-06-30 22:00:00         4        22  ...    22     00     00
48119  2017-06-30 23:00:00         4        12  ...    23     00     00

[48120 rows x 10 columns]